Revit 2027 API
ParameterTypeId.AllModelManufacturer Property
 "Manufacturer"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AllModelManufacturer { get; }
Public Shared ReadOnly Property AllModelManufacturer As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AllModelManufacturer {
	ForgeTypeId^ get ();
}
static member AllModelManufacturer : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace